micropython/micropython/lib/stm32n6/CMSIS/STM32N6xx/Include/stm32n645xx.h
#define GPIOP                     GPIOP_S
#define GPIOP_BASE                GPIOP_BASE_S

#define GPIOQ                     GPIOQ_S
#define GPIOQ_BASE                GPIOQ_BASE_S

#define GPU2D                     GPU2D_BASE_S
#define GPU2D_BASE                GPU2D_BASE_S

#define HASH                      HASH_S
#define HASH_BASE                 HASH_BASE_S

#define HASH_DIGEST               HASH_DIGEST_S
#define HASH_DIGEST_BASE          HASH_DIGEST_BASE_S

#define HPDMA1                    HPDMA1_S
#define HPDMA1_BASE               HPDMA1_BASE_S

#define HPDMA1_Channel0           HPDMA1_Channel0_S
#define HPDMA1_Channel0_BASE      HPDMA1_Channel0_BASE_S

#define HPDMA1_Channel1           HPDMA1_Channel1_S
#define HPDMA1_Channel1_BASE      HPDMA1_Channel1_BASE_S

#define HPDMA1_Channel2           HPDMA1_Channel2_S
#define HPDMA1_Channel2_BASE      HPDMA1_Channel2_BASE_S

#define HPDMA1_Channel3           HPDMA1_Channel3_S
#define HPDMA1_Channel3_BASE      HPDMA1_Channel3_BASE_S

#define HPDMA1_Channel4           HPDMA1_Channel4_S
#define HPDMA1_Channel4_BASE      HPDMA1_Channel4_BASE_S

#define HPDMA1_Channel5           HPDMA1_Channel5_S
#define HPDMA1_Channel5_BASE      HPDMA1_Channel5_BASE_S

#define HPDMA1_Channel6           HPDMA1_Channel6_S
#define HPDMA1_Channel6_BASE      HPDMA1_Channel6_BASE_S

#define HPDMA1_Channel7           HPDMA1_Channel7_S
#define HPDMA1_Channel7_BASE      HPDMA1_Channel7_BASE_S

#define HPDMA1_Channel8           HPDMA1_Channel8_S
#define HPDMA1_Channel8_BASE      HPDMA1_Channel8_BASE_S

#define HPDMA1_Channel9           HPDMA1_Channel9_S
#define HPDMA1_Channel9_BASE      HPDMA1_Channel9_BASE_S

#define HPDMA1_Channel10          HPDMA1_Channel10_S
#define HPDMA1_Channel10_BASE     HPDMA1_Channel10_BASE_S

#define HPDMA1_Channel11          HPDMA1_Channel11_S
#define HPDMA1_Channel11_BASE     HPDMA1_Channel11_BASE_S

#define HPDMA1_Channel12          HPDMA1_Channel12_S
#define HPDMA1_Channel12_BASE     HPDMA1_Channel12_BASE_S

#define HPDMA1_Channel13          HPDMA1_Channel13_S
#define HPDMA1_Channel13_BASE     HPDMA1_Channel13_BASE_S

#define HPDMA1_Channel14          HPDMA1_Channel14_S
#define HPDMA1_Channel14_BASE     HPDMA1_Channel14_BASE_S

#define HPDMA1_Channel15          HPDMA1_Channel15_S
#define HPDMA1_Channel15_BASE     HPDMA1_Channel15_BASE_S

#define I2C1                      I2C1_S
#define I2C1_BASE                 I2C1_BASE_S

#define I2C2                      I2C2_S
#define I2C2_BASE                 I2C2_BASE_S

#define I2C3                      I2C3_S
#define I2C3_BASE                 I2C3_BASE_S

#define I2C4                      I2C4_S
#define I2C4_BASE                 I2C4_BASE_S

#define I3C1                      I3C1_S
#define I3C1_BASE                 I3C1_BASE_S

#define I3C2                      I3C2_S
#define I3C2_BASE                 I3C2_BASE_S

#define IAC                       IAC_S
#define IAC_BASE                  IAC_BASE_S

#define ICACHE                    ICACHE_S
#define ICACHE_BASE               ICACHE_BASE_S

#define IWDG                      IWDG_S
#define IWDG_BASE                 IWDG_BASE_S

#define JPEG                      JPEG_S
#define JPEG_BASE                 JPEG_BASE_S

#define LPTIM1                    LPTIM1_S
#define LPTIM1_BASE               LPTIM1_BASE_S

#define LPTIM2                    LPTIM2_S
#define LPTIM2_BASE               LPTIM2_BASE_S

#define LPTIM3                    LPTIM3_S
#define LPTIM3_BASE               LPTIM3_BASE_S

#define LPTIM4                    LPTIM4_S
#define LPTIM4_BASE               LPTIM4_BASE_S

#define LPTIM5                    LPTIM5_S
#define LPTIM5_BASE               LPTIM5_BASE_S

#define LPUART1                   LPUART1_S
#define LPUART1_BASE              LPUART1_BASE_S

#define LTDC                      LTDC_S
#define LTDC_BASE                 LTDC_BASE_S

#define LTDC_Layer1               LTDC_Layer1_S
#define LTDC_Layer1_BASE          LTDC_Layer1_BASE_S

#define LTDC_Layer2               LTDC_Layer2_S
#define LTDC_Layer2_BASE          LTDC_Layer2_BASE_S


#define MDF1                      MDF1_S
#define MDF1_BASE                 MDF1_BASE_S

#define MDF1_Filter0              MDF1_Filter0_S
#define MDF1_Filter0_BASE         MDF1_Filter0_BASE_S

#define MDF1_Filter1              MDF1_Filter1_S
#define MDF1_Filter1_BASE         MDF1_Filter1_BASE_S

#define MDF1_Filter2              MDF1_Filter2_S
#define MDF1_Filter2_BASE         MDF1_Filter2_BASE_S

#define MDF1_Filter3              MDF1_Filter3_S
#define MDF1_Filter3_BASE         MDF1_Filter3_BASE_S

#define MDF1_Filter4              MDF1_Filter4_S
#define MDF1_Filter4_BASE         MDF1_Filter4_BASE_S

#define MDF1_Filter5              MDF1_Filter5_S
#define MDF1_Filter5_BASE         MDF1_Filter5_BASE_S

#define MDIOS                     MDIOS_S
#define MDIOS_BASE                MDIOS_BASE_S

#define PKA                       PKA_S
#define PKA_BASE                  PKA_BASE_S

#define PSSI                      PSSI_S
#define PSSI_BASE                 PSSI_BASE_S

#define PWR                       PWR_S
#define PWR_BASE                  PWR_BASE_S

#define RAMCFG                    RAMCFG_S
#define RAMCFG_BASE               RAMCFG_BASE_S

#define RAMCFG_SRAM1_AXI          RAMCFG_SRAM1_AXI_S
#define RAMCFG_SRAM1_AXI_BASE     RAMCFG_SRAM1_AXI_BASE_S

#define RAMCFG_SRAM2_AXI          RAMCFG_SRAM2_AXI_S
#define RAMCFG_SRAM2_AXI_BASE     RAMCFG_SRAM2_AXI_BASE_S

#define RAMCFG_SRAM3_AXI          RAMCFG_SRAM3_AXI_S
#define RAMCFG_SRAM3_AXI_BASE     RAMCFG_SRAM3_AXI_BASE_S

#define RAMCFG_SRAM4_AXI          RAMCFG_SRAM4_AXI_S
#define RAMCFG_SRAM4_AXI_BASE     RAMCFG_SRAM4_AXI_BASE_S

#define RAMCFG_SRAM5_AXI          RAMCFG_SRAM5_AXI_S
#define RAMCFG_SRAM5_AXI_BASE     RAMCFG_SRAM5_AXI_BASE_S

#define RAMCFG_SRAM6_AXI          RAMCFG_SRAM6_AXI_S
#define RAMCFG_SRAM6_AXI_BASE     RAMCFG_SRAM6_AXI_BASE_S

#define RAMCFG_SRAM1_AHB          RAMCFG_SRAM1_AHB_S
#define RAMCFG_SRAM1_AHB_BASE     RAMCFG_SRAM1_AHB_BASE_S

#define RAMCFG_SRAM2_AHB          RAMCFG_SRAM2_AHB_S
#define RAMCFG_SRAM2_AHB_BASE     RAMCFG_SRAM2_AHB_BASE_S

#define RAMCFG_VENC_RAM           RAMCFG_VENC_RAM_S
#define RAMCFG_VENC_RAM_BASE      RAMCFG_VENC_RAM_BASE_S

