micropython/micropython/lib/stm32n6/CMSIS/STM32N6xx/Include/stm32n645xx.h
#define RAMCFG_BKPSRAM            RAMCFG_BKPSRAM_S
#define RAMCFG_BKPSRAM_BASE       RAMCFG_BKPSRAM_BASE_S

#define RAMCFG_FLEXRAM            RAMCFG_FLEXRAM_S
#define RAMCFG_FLEXRAM_BASE       RAMCFG_FLEXRAM_BASE_S

#define RCC                       RCC_S
#define RCC_BASE                  RCC_BASE_S

#define RIFSC                     RIFSC_S
#define RIFSC_BASE                RIFSC_BASE_S

#define RISAF1                    RISAF1_S
#define RISAF1_BASE               RISAF1_BASE_S

#define RISAF2                    RISAF2_S
#define RISAF2_BASE               RISAF2_BASE_S

#define RISAF3                    RISAF3_S
#define RISAF3_BASE               RISAF3_BASE_S

#define RISAF6                    RISAF6_S
#define RISAF6_BASE               RISAF6_BASE_S

#define RISAF7                    RISAF7_S
#define RISAF7_BASE               RISAF7_BASE_S

#define RISAF8                    RISAF8_S
#define RISAF8_BASE               RISAF8_BASE_S

#define RISAF9                    RISAF9_S
#define RISAF9_BASE               RISAF9_BASE_S

#define RISAF11                   RISAF11_S
#define RISAF11_BASE              RISAF11_BASE_S

#define RISAF12                   RISAF12_S
#define RISAF12_BASE              RISAF12_BASE_S

#define RISAF13                   RISAF13_S
#define RISAF13_BASE              RISAF13_BASE_S

#define RISAF14                   RISAF14_S
#define RISAF14_BASE              RISAF14_BASE_S

#define RISAF21                   RISAF21_S
#define RISAF21_BASE              RISAF21_BASE_S

#define RISAF22                   RISAF22_S
#define RISAF22_BASE              RISAF22_BASE_S

#define RISAF23                   RISAF23_S
#define RISAF23_BASE              RISAF23_BASE_S

#define RNG                       RNG_S
#define RNG_BASE                  RNG_BASE_S

#define RTC                       RTC_S
#define RTC_BASE                  RTC_BASE_S


#define SAI1                      SAI1_S
#define SAI1_BASE                 SAI1_BASE_S

#define SAI1_Block_A              SAI1_Block_A_S
#define SAI1_Block_A_BASE         SAI1_Block_A_BASE_S

#define SAI1_Block_B              SAI1_Block_B_S
#define SAI1_Block_B_BASE         SAI1_Block_B_BASE_S

#define SAI2                      SAI2_S
#define SAI2_BASE                 SAI2_BASE_S

#define SAI2_Block_A              SAI2_Block_A_S
#define SAI2_Block_A_BASE         SAI2_Block_A_BASE_S

#define SAI2_Block_B              SAI2_Block_B_S
#define SAI2_Block_B_BASE         SAI2_Block_B_BASE_S

#define SDMMC1                    SDMMC1_S
#define SDMMC1_BASE               SDMMC1_BASE_S

#define SDMMC2                    SDMMC2_S
#define SDMMC2_BASE               SDMMC2_BASE_S

#define SPDIFRX                   SPDIFRX_S
#define SPDIFRX_BASE              SPDIFRX_BASE_S

#define SPI1                      SPI1_S
#define SPI1_BASE                 SPI1_BASE_S

#define SPI2                      SPI2_S
#define SPI2_BASE                 SPI2_BASE_S

#define SPI3                      SPI3_S
#define SPI3_BASE                 SPI3_BASE_S

#define SPI4                      SPI4_S
#define SPI4_BASE                 SPI4_BASE_S

#define SPI5                      SPI5_S
#define SPI5_BASE                 SPI5_BASE_S

#define SPI6                      SPI6_S
#define SPI6_BASE                 SPI6_BASE_S

#define SRAMCAN_BASE              SRAMCAN_BASE_S

#define SYSCFG                    SYSCFG_S
#define SYSCFG_BASE               SYSCFG_BASE_S

#define TAMP                      TAMP_S
#define TAMP_BASE                 TAMP_BASE_S

#define TIM1                      TIM1_S
#define TIM1_BASE                 TIM1_BASE_S

#define TIM2                      TIM2_S
#define TIM2_BASE                 TIM2_BASE_S

#define TIM3                      TIM3_S
#define TIM3_BASE                 TIM3_BASE_S

#define TIM4                      TIM4_S
#define TIM4_BASE                 TIM4_BASE_S

#define TIM5                      TIM5_S
#define TIM5_BASE                 TIM5_BASE_S

#define TIM6                      TIM6_S
#define TIM6_BASE                 TIM6_BASE_S

#define TIM7                      TIM7_S
#define TIM7_BASE                 TIM7_BASE_S

#define TIM8                      TIM8_S
#define TIM8_BASE                 TIM8_BASE_S

#define TIM9                      TIM9_S
#define TIM9_BASE                 TIM9_BASE_S

#define TIM10                     TIM10_S
#define TIM10_BASE                TIM10_BASE_S

#define TIM11                     TIM11_S
#define TIM11_BASE                TIM11_BASE_S

#define TIM12                     TIM12_S
#define TIM12_BASE                TIM12_BASE_S

#define TIM13                     TIM13_S
#define TIM13_BASE                TIM13_BASE_S

#define TIM14                     TIM14_S
#define TIM14_BASE                TIM14_BASE_S

#define TIM15                     TIM15_S
#define TIM15_BASE                TIM15_BASE_S

#define TIM16                     TIM16_S
#define TIM16_BASE                TIM16_BASE_S

#define TIM17                     TIM17_S
#define TIM17_BASE                TIM17_BASE_S

#define TIM18                     TIM18_S
#define TIM18_BASE                TIM18_BASE_S

#define UART4                     UART4_S
#define UART4_BASE                UART4_BASE_S

#define UART5                     UART5_S
#define UART5_BASE                UART5_BASE_S

#define UART7                     UART7_S
#define UART7_BASE                UART7_BASE_S

#define UART8                     UART8_S
#define UART8_BASE                UART8_BASE_S

#define UART9                     UART9_S
#define UART9_BASE                UART9_BASE_S

#define UCPD1                     UCPD1_S
#define UCPD1_BASE                UCPD1_BASE_S

#define USART1                    USART1_S
#define USART1_BASE               USART1_BASE_S

#define USART2                    USART2_S
#define USART2_BASE               USART2_BASE_S

#define USART3                    USART3_S
#define USART3_BASE               USART3_BASE_S

#define USART6                    USART6_S
#define USART6_BASE               USART6_BASE_S

