micropython/micropython/lib/stm32n6/CMSIS/STM32N6xx/Include/stm32n645xx.h
#define USART10                   USART10_S
#define USART10_BASE              USART10_BASE_S

#define USB1_OTG_HS               USB1_OTG_HS_S
#define USB1_OTG_HS_BASE          USB1_OTG_HS_BASE_S

#define USB2_OTG_HS               USB2_OTG_HS_S
#define USB2_OTG_HS_BASE          USB2_OTG_HS_BASE_S

#define USB1_HS_PHYC              USB1_HS_PHYC_S
#define USB1_HS_PHYC_BASE         USB1_HS_PHYC_BASE_S

#define USB2_HS_PHYC              USB2_HS_PHYC_S
#define USB2_HS_PHYC_BASE         USB2_HS_PHYC_BASE_S

#define VENC                      VENC_S
#define VENC_BASE                 VENC_BASE_S

#define VREFBUF                   VREFBUF_S
#define VREFBUF_BASE              VREFBUF_BASE_S

#define WWDG                      WWDG_S
#define WWDG_BASE                 WWDG_BASE_S

#define XSPI1                     XSPI1_S

#define XSPI2                     XSPI2_S

#define XSPI3                     XSPI3_S

#define XSPIM                     XSPIM_S
#define XSPIM_BASE                XSPIM_BASE_S

/*!< Unique device ID register base address */
#define UID_BASE                  UID_BASE_S

/*!< Revision ID base address */
#define REVID_BASE                REVID_BASE_S

#else

#define ADC12_COMMON              ADC12_COMMON_NS
#define ADC12_COMMON_BASE         ADC12_COMMON_BASE_NS

#define ADC1                      ADC1_NS
#define ADC1_BASE                 ADC1_BASE_NS

#define ADC2                      ADC2_NS
#define ADC2_BASE                 ADC2_BASE_NS

#define ADF1                      ADF1_NS
#define ADF1_BASE                 ADF1_BASE_NS

#define ADF1_Filter0              ADF1_Filter0_NS
#define ADF1_Filter0_BASE         ADF1_Filter0_BASE_NS

#define BSEC                      BSEC_NS
#define BSEC_BASE                 BSEC_BASE_NS

#define CRC                       CRC_NS
#define CRC_BASE                  CRC_BASE_NS


#define CSI                       CSI_NS
#define CSI_BASE                  CSI_BASE_NS

#define DBGMCU                    DBGMCU_NS
#define DBGMCU_BASE               DBGMCU_BASE_NS

#define DCMI                      DCMI_NS
#define DCMI_BASE                 DCMI_BASE_NS

#define DCMIPP                    DCMIPP_NS
#define DCMIPP_BASE               DCMIPP_BASE_NS

#define DLYB_SDMMC1               DLYB_SDMMC1_NS
#define DLYB_SDMMC1_BASE          DLYB_SDMMC1_BASE_NS

#define DLYB_SDMMC2               DLYB_SDMMC2_NS
#define DLYB_SDMMC2_BASE          DLYB_SDMMC2_BASE_NS

#define DMA2D                     DMA2D_NS
#define DMA2D_BASE                DMA2D_BASE_NS

#define DTS                       DTS_NS
#define DTS_BASE                  DTS_BASE_NS

#define DTS_Sensor0               DTS_Sensor0_NS
#define DTS_Sensor0_BASE          DTS_Sensor0_BASE_NS

#define DTS_Sensor1               DTS_Sensor1_NS
#define DTS_Sensor1_BASE          DTS_Sensor1_BASE_NS

#define ETH1                      ETH1_NS
#define ETH1_BASE                 ETH1_BASE_NS

#define EXTI                      EXTI_NS
#define EXTI_BASE                 EXTI_BASE_NS

#define FDCAN1                    FDCAN1_NS
#define FDCAN1_BASE               FDCAN1_BASE_NS

#define FDCAN2                    FDCAN2_NS
#define FDCAN2_BASE               FDCAN2_BASE_NS

#define FDCAN3                    FDCAN3_NS
#define FDCAN3_BASE               FDCAN3_BASE_NS

#define FDCAN_CCU                 FDCAN_CCU_NS
#define FDCAN_CCU_BASE            FDCAN_CCU_BASE_NS

#define FMC_R_BASE                FMC_R_BASE_NS
#define FMC_R_BASE_BASE           FMC_R_BASE_BASE_NS

#define FMC_Bank1E_R              FMC_Bank1E_R_NS
#define FMC_Bank1E_R_BASE         FMC_Bank1E_R_BASE_NS

#define FMC_Bank1_R               FMC_Bank1_R_NS
#define FMC_Bank1_Rv              FMC_Bank1_R_BASE_NS

#define FMC_Bank3_R               FMC_Bank3_R_NS
#define FMC_Bank3_R_BASE          FMC_Bank3_R_BASE_NS

#define FMC_Bank5_6_R             FMC_Bank5_6_R_NS
#define FMC_Bank5_6_R_BASE        FMC_Bank5_6_R_BASE_NS

#define FMC_Common_R              FMC_Common_R_NS
#define FMC_Common_R_BASE         FMC_Common_R_BASE_NS

#define GFXMMU                       GFXMMU_NS
#define GFXMMU_BASE                  GFXMMU_BASE_NS
#define GFXMMU_VIRTUAL_BUFFER0_BASE  GFXMMU_VIRTUAL_BUFFER0_BASE_NS
#define GFXMMU_VIRTUAL_BUFFER1_BASE  GFXMMU_VIRTUAL_BUFFER1_BASE_NS
#define GFXMMU_VIRTUAL_BUFFER2_BASE  GFXMMU_VIRTUAL_BUFFER2_BASE_NS
#define GFXMMU_VIRTUAL_BUFFER3_BASE  GFXMMU_VIRTUAL_BUFFER3_BASE_NS

#define GFXTIM                    GFXTIM_NS
#define GFXTIM_BASE               GFXTIM_BASE_NS

#define GPDMA1                    GPDMA1_NS
#define GPDMA1_BASE               GPDMA1_BASE_NS

#define GPDMA1_Channel0           GPDMA1_Channel0_NS
#define GPDMA1_Channel0_BASE      GPDMA1_Channel0_BASE_NS

#define GPDMA1_Channel1           GPDMA1_Channel1_NS
#define GPDMA1_Channel1_BASE      GPDMA1_Channel1_BASE_NS

#define GPDMA1_Channel2           GPDMA1_Channel2_NS
#define GPDMA1_Channel2_BASE      GPDMA1_Channel2_BASE_NS

#define GPDMA1_Channel3           GPDMA1_Channel3_NS
#define GPDMA1_Channel3_BASE      GPDMA1_Channel3_BASE_NS

#define GPDMA1_Channel4           GPDMA1_Channel4_NS
#define GPDMA1_Channel4_BASE      GPDMA1_Channel4_BASE_NS

#define GPDMA1_Channel5           GPDMA1_Channel5_NS
#define GPDMA1_Channel5_BASE      GPDMA1_Channel5_BASE_NS

#define GPDMA1_Channel6           GPDMA1_Channel6_NS
#define GPDMA1_Channel6_BASE      GPDMA1_Channel6_BASE_NS

#define GPDMA1_Channel7           GPDMA1_Channel7_NS
#define GPDMA1_Channel7_BASE      GPDMA1_Channel7_BASE_NS

#define GPDMA1_Channel8           GPDMA1_Channel8_NS
#define GPDMA1_Channel8_BASE      GPDMA1_Channel8_BASE_NS

#define GPDMA1_Channel9           GPDMA1_Channel9_NS
#define GPDMA1_Channel9_BASE      GPDMA1_Channel9_BASE_NS

#define GPDMA1_Channel10          GPDMA1_Channel10_NS
#define GPDMA1_Channel10_BASE     GPDMA1_Channel10_BASE_NS

#define GPDMA1_Channel11          GPDMA1_Channel11_NS
#define GPDMA1_Channel11_BASE     GPDMA1_Channel11_BASE_NS

#define GPDMA1_Channel12          GPDMA1_Channel12_NS
#define GPDMA1_Channel12_BASE     GPDMA1_Channel12_BASE_NS

#define GPDMA1_Channel13          GPDMA1_Channel13_NS
#define GPDMA1_Channel13_BASE     GPDMA1_Channel13_BASE_NS

#define GPDMA1_Channel14          GPDMA1_Channel14_NS
#define GPDMA1_Channel14_BASE     GPDMA1_Channel14_BASE_NS

#define GPDMA1_Channel15          GPDMA1_Channel15_NS
#define GPDMA1_Channel15_BASE     GPDMA1_Channel15_BASE_NS

