micropython/micropython/lib/stm32n6/CMSIS/STM32N6xx/Include/stm32n645xx.h
/******************************* RNG Instances *******************************/
#define IS_RNG_ALL_INSTANCE(INSTANCE) ((INSTANCE) == RNG_NS)

/******************************* RTC Instances *******************************/
#define IS_RTC_ALL_INSTANCE(INSTANCE) ((INSTANCE) == RTC_NS)

/******************************** SAI Instances ******************************/
#define IS_SAI_ALL_INSTANCE(INSTANCE) (((INSTANCE) == SAI1_Block_A_NS) || \
                                       ((INSTANCE) == SAI1_Block_B_NS) || \
                                       ((INSTANCE) == SAI2_Block_A_NS) || \
                                       ((INSTANCE) == SAI2_Block_B_NS))

/******************************* SDMMC Instances *****************************/
#define IS_SDMMC_ALL_INSTANCE(INSTANCE) (((INSTANCE) == SDMMC1_NS) || \
                                         ((INSTANCE) == SDMMC2_NS))

/******************************** SMBUS Instances ****************************/
#define IS_SMBUS_ALL_INSTANCE(INSTANCE) (((INSTANCE) == I2C1_NS) || \
                                         ((INSTANCE) == I2C2_NS) || \
                                         ((INSTANCE) == I2C3_NS) || \
                                         ((INSTANCE) == I2C4_NS))

/****************************** SPDIFRX Instances ****************************/
#define IS_SPDIFRX_ALL_INSTANCE(INSTANCE) ((INSTANCE) == SPDIFRX_NS)

/******************************** SPI Instances ******************************/
#define IS_SPI_ALL_INSTANCE(INSTANCE) (((INSTANCE) == SPI1_NS) || \
                                       ((INSTANCE) == SPI2_NS) || \
                                       ((INSTANCE) == SPI3_NS) || \
                                       ((INSTANCE) == SPI4_NS) || \
                                       ((INSTANCE) == SPI5_NS) || \
                                       ((INSTANCE) == SPI6_NS))

#define IS_SPI_FULL_INSTANCE(INSTANCE) (((INSTANCE) == SPI1_NS) || \
                                        ((INSTANCE) == SPI2_NS) || \
                                        ((INSTANCE) == SPI3_NS) || \
                                        ((INSTANCE) == SPI6_NS))

#define IS_SPI_LIMITED_INSTANCE(INSTANCE) (((INSTANCE) == SPI4_NS) || \
                                           ((INSTANCE) == SPI5_NS))

/******************************** I2S Instances ******************************/
#define IS_I2S_ALL_INSTANCE(INSTANCE) (((INSTANCE) == SPI1_NS) || \
                                       ((INSTANCE) == SPI2_NS) || \
                                       ((INSTANCE) == SPI3_NS) || \
                                       ((INSTANCE) == SPI6_NS))

/****************************** UCPD Instances *******************************/
#define IS_UCPD_ALL_INSTANCE(INSTANCE) ((INSTANCE) == UCPD1_NS)

/******************************* OTG HS HCD Instances *************************/
#define IS_HCD_ALL_INSTANCE(INSTANCE) (((INSTANCE) == USB1_OTG_HS_NS) || \
                                       ((INSTANCE) == USB2_OTG_HS_NS))

/******************************* OTG HS PCD Instances *************************/
#define IS_PCD_ALL_INSTANCE(INSTANCE) (((INSTANCE) == USB1_OTG_HS_NS) || \
                                       ((INSTANCE) == USB2_OTG_HS_NS))

/******************************* USB HS PHY Instances *************************/
#define IS_USBPHYC_ALL_INSTANCE(INSTANCE) (((INSTANCE) == USB1_HS_PHYC_NS) || \
                                           ((INSTANCE) == USB2_HS_PHYC_NS))

/******************** USART Instances : Synchronous mode *********************/
#define IS_USART_INSTANCE(INSTANCE) (((INSTANCE) == USART1_NS) || \
                                     ((INSTANCE) == USART2_NS) || \
                                     ((INSTANCE) == USART3_NS) || \
                                     ((INSTANCE) == USART6_NS) || \
                                     ((INSTANCE) == USART10_NS))

/******************** UART Instances : Asynchronous mode *********************/
#define IS_UART_INSTANCE(INSTANCE) (((INSTANCE) == USART1_NS) || \
                                    ((INSTANCE) == USART2_NS) || \
                                    ((INSTANCE) == USART3_NS) || \
                                    ((INSTANCE) == UART4_NS)  || \
                                    ((INSTANCE) == UART5_NS)  || \
                                    ((INSTANCE) == USART6_NS) || \
                                    ((INSTANCE) == UART7_NS)  || \
                                    ((INSTANCE) == UART8_NS)  || \
                                    ((INSTANCE) == UART9_NS)  || \
                                    ((INSTANCE) == USART10_NS))

/*********************** UART Instances : FIFO mode **************************/
#define IS_UART_FIFO_INSTANCE(INSTANCE) (((INSTANCE) == USART1_NS)  || \
                                         ((INSTANCE) == USART2_NS)  || \
                                         ((INSTANCE) == USART3_NS)  || \
                                         ((INSTANCE) == UART4_NS)   || \
                                         ((INSTANCE) == UART5_NS)   || \
                                         ((INSTANCE) == USART6_NS)  || \
                                         ((INSTANCE) == UART7_NS)   || \
                                         ((INSTANCE) == UART8_NS)   || \
                                         ((INSTANCE) == UART9_NS)   || \
                                         ((INSTANCE) == USART10_NS) || \
                                         ((INSTANCE) == LPUART1_NS))

/*********************** UART Instances : SPI Slave mode **********************/
#define IS_UART_SPI_SLAVE_INSTANCE(INSTANCE) (((INSTANCE) == USART1_NS)  || \
                                              ((INSTANCE) == USART2_NS)  || \
                                              ((INSTANCE) == USART3_NS)  || \
                                              ((INSTANCE) == USART6_NS)  || \
                                              ((INSTANCE) == USART10_NS))

/****************** UART Instances : Auto Baud Rate detection ****************/
#define IS_USART_AUTOBAUDRATE_DETECTION_INSTANCE(INSTANCE) (((INSTANCE) == USART1_NS)  || \
                                                            ((INSTANCE) == USART2_NS)  || \
                                                            ((INSTANCE) == USART3_NS)  || \
                                                            ((INSTANCE) == UART4_NS)   || \
                                                            ((INSTANCE) == UART5_NS)   || \
                                                            ((INSTANCE) == USART6_NS)  || \
                                                            ((INSTANCE) == UART7_NS)   || \
                                                            ((INSTANCE) == UART8_NS)   || \
                                                            ((INSTANCE) == UART9_NS)   || \
                                                            ((INSTANCE) == USART10_NS))

/****************** UART Instances : Driver Enable ***************************/
#define IS_UART_DRIVER_ENABLE_INSTANCE(INSTANCE) (((INSTANCE) == USART1_NS)  || \
                                                  ((INSTANCE) == USART2_NS)  || \
                                                  ((INSTANCE) == USART3_NS)  || \
                                                  ((INSTANCE) == UART4_NS)   || \
                                                  ((INSTANCE) == UART5_NS)   || \
                                                  ((INSTANCE) == USART6_NS)  || \
                                                  ((INSTANCE) == UART7_NS)   || \
                                                  ((INSTANCE) == UART8_NS)   || \
                                                  ((INSTANCE) == UART9_NS)   || \
                                                  ((INSTANCE) == USART10_NS) || \
                                                  ((INSTANCE) == LPUART1_NS))

/******************** UART Instances : Half-Duplex mode **********************/
#define IS_UART_HALFDUPLEX_INSTANCE(INSTANCE) (((INSTANCE) == USART1_NS)  || \
                                               ((INSTANCE) == USART2_NS)  || \
                                               ((INSTANCE) == USART3_NS)  || \
                                               ((INSTANCE) == UART4_NS)   || \
                                               ((INSTANCE) == UART5_NS)   || \
                                               ((INSTANCE) == USART6_NS)  || \
                                               ((INSTANCE) == UART7_NS)   || \
                                               ((INSTANCE) == UART8_NS)   || \
                                               ((INSTANCE) == UART9_NS)   || \
                                               ((INSTANCE) == USART10_NS) || \
                                               ((INSTANCE) == LPUART1_NS))

/****************** UART Instances : Hardware Flow control *******************/
#define IS_UART_HWFLOW_INSTANCE(INSTANCE) (((INSTANCE) == USART1_NS)  || \
                                           ((INSTANCE) == USART2_NS)  || \
                                           ((INSTANCE) == USART3_NS)  || \
                                           ((INSTANCE) == UART4_NS)   || \
                                           ((INSTANCE) == UART5_NS)   || \
                                           ((INSTANCE) == USART6_NS)  || \
                                           ((INSTANCE) == UART7_NS)   || \
                                           ((INSTANCE) == UART8_NS)   || \
                                           ((INSTANCE) == UART9_NS)   || \
                                           ((INSTANCE) == USART10_NS) || \
                                           ((INSTANCE) == LPUART1_NS))

/******************** UART Instances : LIN mode ******************************/
#define IS_UART_LIN_INSTANCE(INSTANCE) (((INSTANCE) == USART1_NS) || \
                                        ((INSTANCE) == USART2_NS)  || \
                                        ((INSTANCE) == USART3_NS)  || \
                                        ((INSTANCE) == UART4_NS)   || \
                                        ((INSTANCE) == UART5_NS)   || \
                                        ((INSTANCE) == USART6_NS)  || \
                                        ((INSTANCE) == UART7_NS)   || \
                                        ((INSTANCE) == UART8_NS)   || \
                                        ((INSTANCE) == UART9_NS)   || \
                                        ((INSTANCE) == USART10_NS))

/******************** UART Instances : Wake-up from Stop mode ****************/
#define IS_UART_WAKEUP_FROMSTOP_INSTANCE(INSTANCE) (((INSTANCE) == USART1_NS)  || \
                                                    ((INSTANCE) == USART2_NS)  || \
                                                    ((INSTANCE) == USART3_NS)  || \
                                                    ((INSTANCE) == UART4_NS)   || \
                                                    ((INSTANCE) == UART5_NS)   || \
                                                    ((INSTANCE) == USART6_NS)  || \
                                                    ((INSTANCE) == UART7_NS)   || \
                                                    ((INSTANCE) == UART8_NS)   || \
                                                    ((INSTANCE) == UART9_NS)   || \
                                                    ((INSTANCE) == USART10_NS) || \
                                                    ((INSTANCE) == LPUART1_NS))

/*********************** UART Instances : IRDA mode **************************/
#define IS_IRDA_INSTANCE(INSTANCE) (((INSTANCE) == USART1_NS)  || \
                                    ((INSTANCE) == USART2_NS)  || \
                                    ((INSTANCE) == USART3_NS)  || \
                                    ((INSTANCE) == UART4_NS)   || \
                                    ((INSTANCE) == UART5_NS)   || \
                                    ((INSTANCE) == USART6_NS)  || \
                                    ((INSTANCE) == UART7_NS)   || \
                                    ((INSTANCE) == UART8_NS)   || \
                                    ((INSTANCE) == UART9_NS)   || \
                                    ((INSTANCE) == USART10_NS))

